# 必要なライブラリ
- conda install sqlalchemy
- conda install lxml
- conda install html5lib
- conda install BeautifulSoup4

In [1]:
import pandas as pd

In [2]:
pwd

'D:\\dev\\udemy\\python\\notebook\\11_data_science\\02_pandas'

# CSV

In [7]:
df = pd.read_csv("example.csv")

In [14]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [9]:
df.to_csv("My_output.csv", index=False)

# Excel

In [12]:
df = pd.read_excel("Excel_example.xlsx", sheet_name="Sheet1")

In [13]:
df

   a  b  c
0  1  2  3
1  4  5  6

# HTML

In [19]:
# tableタグを見つけて読み込んでくれる
data = pd.read_html("https://www.nba.com/stats/players/traditional?PerMode=Totals&sort=PTS&dir=-1")

In [23]:
data[0]

   Sun  Mon  Tues  Wed  Thurs  Fri  Sat
0   29   30    31    1      2    3    4
1    5    6     7    8      9   10   11
2   12   13    14   15     16   17   18
3   19   20    21   22     23   24   25
4   26   27    28   29     30    1    2

# SQL

In [24]:
from sqlalchemy import create_engine

In [27]:
engine = create_engine("sqlite:///:memory:")

In [28]:
df.to_sql("my_table", engine)

2

In [29]:
# 残念ながらエラーになる
sqldf = pd.read_sql("my_table", con=engine)

AttributeError: 'OptionEngine' object has no attribute 'execute'